Workspace/test_cases/sod_shock_tube-waveTransmition-p/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
5000
(
120000
120000
120000
120000
120000
120000
120000
120000
...
)
;

boundaryField
{
    sides
    {
        type            zeroGradient;
    }
    emptywalls
    {
        type            empty;
    }
}


// ************************************************************************* //
